In [1]:
import pandas as pd

data = {
    "id": [1, 2, 3, 4, 5],
    "value": [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)

In [2]:
df

   id  value
0   1     10
1   2     20
2   3     30
3   4     40
4   5     50

In [3]:
#in python, we have functions like rolling, expanding, rank and shift for windowing functions.

In [5]:
"""SELECT value,
       AVG(value) OVER (ORDER BY id ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) as rolling_avg,
       RANK() OVER (ORDER BY value) as rank,
       LAG(value, 1) OVER (ORDER BY id) as lag
FROM table;"""

'SELECT value,\n       AVG(value) OVER (ORDER BY id ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) as rolling_avg,\n       RANK() OVER (ORDER BY value) as rank,\n       LAG(value, 1) OVER (ORDER BY id) as lag\nFROM table;'

In [7]:
df['rank']=df['value'].rank( ascending =True)

In [8]:
df

   id  value  rank_value  rank
0   1     10         1.0   1.0
1   2     20         2.0   2.0
2   3     30         3.0   3.0
3   4     40         4.0   4.0
4   5     50         5.0   5.0

In [9]:
df['lag']=df['value'].shift(1)

In [10]:
df

   id  value  rank_value  rank   lag
0   1     10         1.0   1.0   NaN
1   2     20         2.0   2.0  10.0
2   3     30         3.0   3.0  20.0
3   4     40         4.0   4.0  30.0
4   5     50         5.0   5.0  40.0

In [11]:
df['lead']=df['value'].shift(-1)

In [12]:
df

   id  value  rank_value  rank   lag  lead
0   1     10         1.0   1.0   NaN  20.0
1   2     20         2.0   2.0  10.0  30.0
2   3     30         3.0   3.0  20.0  40.0
3   4     40         4.0   4.0  30.0  50.0
4   5     50         5.0   5.0  40.0   NaN

In [13]:
# for rownumber, we have .rank(method='first')

In [14]:
df['row_num']=df['value'].rank(method='first')

In [15]:
df

   id  value  rank_value  rank   lag  lead  row_num
0   1     10         1.0   1.0   NaN  20.0      1.0
1   2     20         2.0   2.0  10.0  30.0      2.0
2   3     30         3.0   3.0  20.0  40.0      3.0
3   4     40         4.0   4.0  30.0  50.0      4.0
4   5     50         5.0   5.0  40.0   NaN      5.0

In [16]:
import pandas as pd

df = pd.DataFrame({"id":[1,2,3,4,5],
                   "value":[10,20,30,40,50]})

# Cumulative Sum (SQL: SUM OVER ORDER BY)
df["cum_sum"] = df["value"].cumsum()

# Cumulative Max
df["cum_max"] = df["value"].cummax()

# Cumulative Min
df["cum_min"] = df["value"].cummin()

# Cumulative Count
df["cum_count"] = df["value"].expanding().count().astype(int)

print(df)

   id  value  cum_sum  cum_max  cum_min  cum_count
0   1     10       10       10       10          1
1   2     20       30       20       10          2
2   3     30       60       30       10          3
3   4     40      100       40       10          4
4   5     50      150       50       10          5